[{"author":"Altin Isaksson","twitter":"jodyferry","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/jodyferry/73.jpg","text":"Thank you for the well prepared materials. It seems like I had the general understanding of 50% of materials already before the training. But only now I understood HOW TO APPLY this knowledge in my company. I am curious to try it in the real situations in my work."},{"author":"Kenji","twitter":"9lessons","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/9lessons/73.jpg","text":"My favorite part was about Supply Chains complexity. Your Supply Chain is as strong as it’s weakest link… That’s simple and great!"},{"author":"Bruno Guerin","twitter":"_arashasghari","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/_arashasghari/73.jpg","text":"Pavlo has a great ability to explain the complex ideas in simple way. Very nicely structured and applicable knowledge base in so short time."},{"author":"Randy Adkins","twitter":"insistimento","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/insistimento/73.jpg","text":"After this training I have more questions than answers. I looked at my organization with the different pair of eyes. More critical and more skeptical. I revealed a lot of opportunities for development here…"},{"author":"Elmer Johnsson","twitter":"mathelme","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/mathelme/73.jpg","text":"The best thing about this development program is on-line. I sit at home or at my office, and I can study. All I need is just internet and headphones. No travels and no extra time."},{"author":"Anton Jakobsson","twitter":"abrodo","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/abrodo/73.jpg","text":"The best thing about this development program is on-line. I sit at home or at my office, and I can study. All I need is just internet and headphones. No travels and no extra time."},{"author":"Trevor Pierce","twitter":"noxdzine","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/noxdzine/73.jpg","text":"Great material, great speaker. I was scared to have the training in English, because I don’t know it so good, but it was simple English language so I understand 90% of the material…"},{"author":"Jose Jackson","twitter":"rafaelrinaldi","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/rafaelrinaldi/73.jpg","text":"Thank you Better Purchasing for giving me confidence for my job. Now I have the arguments to prove that procurement department is not a Cost center, but a PROFIT center!!"},{"author":"Mathew Austin","twitter":"raquelromanp","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/raquelromanp/73.jpg","text":"I like that the course was one month long, this helps to try the things we learn. After the second week of the training I have reduced the prices with three of my key suppliers by 12%!!! The ROI of this training is enormous!!!"},{"author":"Harald Nordin","twitter":"andrewcohen","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/andrewcohen/73.jpg","text":"Thank you Better Purchasing for making me believe in myself and in my profession again!..."},{"author":"Harvey Guzman","twitter":"jdallcaps","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/jdallcaps/73.jpg","text":"I didn’t have so many trainings before, but this one was just super. It was well-designed, interesting, practical and applicable, without too much theory like in the school… …Of course I will recommend and this to my colleagues."},{"author":"Derek Mccormick","twitter":"scott_allison","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/scott_allison/73.jpg","text":"…if more purchasers would join such trainings – our profession would be more respectful and recognizable."},{"author":"Donnie Phelps","twitter":"horaciobella","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/horaciobella/73.jpg","text":"I thought that Indian suppliers are special and too demanding. But I see that purchasers from Europe and America have the same problems. So in general suppliers all are all the same around the world. They want the same things and they hate the same things. So it was good to know how I can cooperate with them in a win-win way!"},{"author":"Brett Reyes","twitter":"thaume","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/thaume/73.jpg","text":"It seems to be funny – I am the Manager of Purchasing department, but no special education. I have attended trainings in Ernst&Young and in Delloite on the topics related to my department’s work. But they didn’t give me as comprehensive view on business as Better Purchasing has done! And the price for the 4 weeks course here is just 10% of the price of consultants!"},{"author":"Kenny Gordon","twitter":"chrisrowe","imageurl":"https://s3.amazonaws.com/uifaces/faces/twitter/chrisrowe/73.jpg","text":"This training program can give a fast introduction to the world of Purchasing, Procurement and Supply Chain management. I would recommend this to the people who are working in this area for 1-3 years and want to answer their questions. If I would come to this course 10 years ago – I would achieve much more till now:)"}]